app/controllers/customers_controller.rb

INSERT INTO "customers" ("name", "username", "password_digest", "img_url", "balance", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        customer = Customer.create(permit_params)

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @customer = Customer.find(session[:customer_id])

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "customers" SET "description" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["description", "Flatiron"], ["updated_at", "2019-06-17 18:08:43.893890"], ["id", 1]]
---
    def update
        customer = Customer.find(params[:id])
        customer.update(permit_params)