app/controllers/restaurants_controller.rb

INSERT INTO "restaurants" ("username", "name", "street_address", "zip", "phone_number", "description", "img_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        restaurant = Restaurant.create(permit_params)

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "restaurants" SET "username" = ?, "name" = ?, "img_url" = ?, "updated_at" = ? WHERE "restaurants"."id" = ?  [["username", ""], ["name", "78 Cafee"], ["img_url", ""], ["updated_at", "2019-06-17 18:16:12.054432"], ["id", 1]]
---
    def update
        restaurant = Restaurant.find(params[:id])
        restaurant.update(permit_params)