app/models/customer.rb

SELECT  "customers".* FROM "customers" ORDER BY "customers"."id" DESC LIMIT ?  [["LIMIT", 1]]
SELECT  "customers".* FROM "customers" ORDER BY "customers"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
    def increment
        if self.id == Customer.last.id
            next_id = Customer.first.id