app/models/restaurant.rb

    def next_id
        if (self.id + 1 == Restaurant.last.id + 1)
            next_id = Restaurant.first.id
---
SELECT  "restaurants".* FROM "restaurants" ORDER BY "restaurants"."id" DESC LIMIT ?  [["LIMIT", 1]]
SELECT  "restaurants".* FROM "restaurants" ORDER BY "restaurants"."id" ASC LIMIT ?  [["LIMIT", 1]]